app/controllers/api/photos_controller.rb

    def index
        # debugger
        if params[:album_id]
            @photos = Photo.where({album_id: params[:album_id]})
            render :index
        elsif params[:user_id]
            @photos = Photo.where({user_id: params[:user_id]})
            render :index
        else
            @photos = Photo.all
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "photos".* FROM "photos"