app/controllers/application_controller.rb

    def current_user
        # fetches the user we've logged in as
        @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "iIGQvzo1MXAm1UGbYlAYEQ"], ["LIMIT", 1]]